In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [5]:
dframe1 = DataFrame(np.arange(8).reshape((2,4)),
                   index = pd.Index(['LA','SF'],
                                   name = 'city'),
                   columns = pd.Index(['A','B','C','D'],
                                     name = 'lettter'))
dframe1

lettter  A  B  C  D
city
LA       0  1  2  3
SF       4  5  6  7

In [6]:
dframe_st = dframe1.stack()
dframe_st
# stack up values, meaning wide to long

city  lettter
LA    A          0
      B          1
      C          2
      D          3
SF    A          4
      B          5
      C          6
      D          7
dtype: int64

In [8]:
dframe_st.unstack()

lettter  A  B  C  D
city
LA       0  1  2  3
SF       4  5  6  7

In [ ]:
dframe_st.